import React, {useState} from 'react';
import school from "./../../../images/school.jpg"
import child from "./../../../images/students.png"
import book from "./../../../images/book.png"
import teach from "./../../../images/teach.png"
import {media} from "../../media";

const Info = () => {

    const [modal, setModal] = useState(false)

    return (
        <section id="info">
            <div className="container">
                <div className="info-general__width"/>
                <div className="info-general">
                    <div className="info-general__block">
                        <div style={{width: media(250, 625), height: media(190, 438), margin: media(10, 25)}}/>
                        <img src={school} alt="img" style={{width: media(250, 625), height: media(190, 438)}}/>
                    </div>
                    <div className="info-general__block2">
                        <h1>Мектеп тууралуу маалымат</h1>
                        <div className="info-general__block2__gen">
                            <div className="info-general__block2__gen__cer"
                                 style={{width: media(70, 100), height: media(70, 100)}}>
                                <img src={child} alt="img"/>
                            </div>
                            <div className="info-general__block2__gen__item">
                                <h2>Учурдагы окуучулар</h2>
                                <h3>142</h3>
                            </div>
                        </div>
                        <div className="info-general__block2__gen">
                            <div className="info-general__block2__gen__cer"
                                 style={{width: media(70, 100), height: media(70, 100)}}>
                                <img src={book} alt="img"/>
                            </div>
                            <div className="info-general__block2__gen__item">
                                <h2>Жалпы китептердин саны</h2>
                                <h3>3481</h3>
                            </div>
                        </div>
                        <div className="info-general__block2__gen">
                            <div className="info-general__block2__gen__cer"
                                 style={{width: media(70, 100), height: media(70, 100)}}>
                                <img src={teach} alt="img"/>
                            </div>
                            <div className="info-general__block2__gen__item">
                                <h2>Учурдагы мугалимдер</h2>
                                <h3>26</h3>
                            </div>
                        </div>
                    </div>
                </div>
                <div className="info-general2">
                    {/*<p style={{fontSize: media(16, 18)}}> Вот уже 38 лет наша школа распахивает свои двери учителям, ученикам и их родителям. И первый*/}
                    {/*    человек который встречает их на пороге школы — это директор. Как важно иметь в школе*/}
                    {/*    руководителя, который смог организовать и направить всю деятельность коллектива педагогов и*/}
                    {/*    учеников в нужное русло. На протяжении этих лет нашу школу возглавляли мудрые и талантливые,*/}
                    {/*    инициативные люди.</p>*/}
                    <button
                        onClick={() => setModal(true)}
                    >Толук маалымат
                    </button>
                    {modal && (
                        <div className="info-general2__modal">
                            <div className="info-general2__modal__block">
                                <h1 onClick={() => setModal(false)}>Жабуу</h1>
                                <p>К.Жапаров атындагы орто мектеби, Кулчу айылында жайгашкан, 1960'жылдары, Сейдакмат
                                    аксакалдын үйүнүн бир каанасына 1,2 класс ачылып, 6 окуучу окуган,Ысык Көлдөн Эрмек
                                    деген агай келип сабак берип жүргөн, кийинчерээк, 1980-жылдары мектеп салынып,
                                    карлик баштооч мектеби болгон, 1990-жылдары ашар жолу менен, Кулчу толук эмес орто
                                    мектеби болуп ачылып 80окуучу окуган, 2012-жылга чейин толук эмес орто мектеби,
                                    2012-жылдан 2017-окуу жылдары негизги мектеп, 100 окуучу, окуган, 2017 жылдан баштап
                                    орто мектеп макамын алып 147 окуучу окуду, 2016-жыл болуп өткөн жер титирөөдөн улам,
                                    мектеп жараксыз
                                    [1/6, 20:39] Ширин Эжеке: Абалда болуп, 2017-жылы мектептин 150орундуу 2 кабаттуу,
                                    сметалык баасы 52миллион сомдук мектеп салынып 2018-жылы 12'сентябрдан баштап жаңы
                                    имаратта окуп баштадык, мектеп типтүү, 150орундуу, китепкана, ашкана, жыйындар залы
                                    ичинде, жаш муундардын билим алуусу үчүн эң жакшы шарттар түзүлгөн. 1995-жылдан
                                    2002-жылга чейин Кыпчакбаев Самидин, 2002-жылдан 2006-жылдары, Осмонова Шаапахат,
                                    2006-жылдан 2012-жылдары Жээнбаева Жибек, 2012-2013жылдары Куштаров Абдилбадут
                                    жетектешти, 2013-жылдан ушу күнгө чейин Егембердиева Ширин жетектеп келүүдө. Мектеп
                                    2019-жылдан тартып айылдын ардактуу атуулу Курсанбай Жапаровдун атын алган.
                                    Мектептин техникалык материалдык базасы жөнүндө маалымат, мектепте 2019-жылы
                                    Жергиликтүү өз алдынча башкаруу органдары менен биргеликте ИПРге проект жазып бир
                                    акылдуу доска, 1проектр, 1 ноутбук, 1 түстүү принтер утуп алганбыз, 2020 жылы ушул
                                    эле уюумдун уюштурган сынагына катышып, мектеп директору Ш.Егембеидиева 80 миң
                                    сомдук музыкалык аппаратураларды уттуп алган, мугалимдердин, демөөрчүлөрдүн жардамы
                                    менен 200миң сомдук оформление жасалгасы менен жасалгаланды, 2021-жылы К.Жапаровдун
                                    үй бүлөсүнүн демөөрчүлүгү жана мугалимдердин демөөрчүлүгү менен китепканага 50миң
                                    сомдук адабий китептер сатылып алынды.
                                    Мектептин ЖРТдан алган орточо баллы 113, 2019жылкы бүтүрүүчүлөрдөн эң жогорку упай
                                    189, 2020, жылкылардан эң жогоркусу 152, упай , 2021-жылкы бүтүрүүчүлөрдүн катышан
                                    окуучулардын 80% босого баллдан өтүшүп азыркы учурда жогорку окуу жайларда окуп
                                    жатышат.
                                    Предметтик олимпиадаларга 3жылдан бери катышууга укук алышып үч жылдын ичинде 1
                                    окуучу, райондук турунан 2 опунга татыктуу болду
                                </p>
                            </div>
                        </div>
                    )}
                </div>
            </div>
        </section>
    );
};

export default Info;